IDEA StatiCa Open Model
ConcreteCheckResultOverall.Checks Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 All check by the type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ConcreteCheckResultOverallItem> Checks { get; set; }
Public Property Checks As List(Of ConcreteCheckResultOverallItem)
	Get
	Set
public:
property List<ConcreteCheckResultOverallItem^>^ Checks {
	List<ConcreteCheckResultOverallItem^>^ get ();
	void set (List<ConcreteCheckResultOverallItem^>^ value);
}
Property Value
Type: List<ConcreteCheckResultOverallItem>
See Also
Reference
ConcreteCheckResultOverall Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace